In [1]:
import pandas as pd

In [2]:
df_dataset = pd.read_csv("https://rcs.bu.edu/examples/python/DataAnalysis/Salaries.csv")

In [3]:
df_dataset.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [4]:
df_dataset.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [8]:
df_dataset.shape

(78, 6)

In [10]:
df_dataset['phd'].std()

12.498424809175866

In [19]:
df_dataset.head(50)[['phd','service','salary']].mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [20]:
df_dataset.head(-10)

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450

[68 rows x 6 columns]

In [21]:
df_dataset.head(-5)

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101

[73 rows x 6 columns]

In [22]:
df_dataset.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [23]:
df_dataset.size

468

In [25]:
df_dataset.shape[0]

78

In [26]:
df_dataset.ndim

2

In [27]:
df_dataset.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [29]:
df_dataset.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [30]:
df_dataset['salary'].describe()

count        78.000000
mean     108023.782051
std       28293.661022
min       57800.000000
25%       88612.500000
50%      104671.000000
75%      126774.750000
max      186960.000000
Name: salary, dtype: float64

In [33]:
df_dataset[['salary']].count()

salary    78
dtype: int64

In [34]:
df_dataset['salary'].count()

78

In [35]:
df_dataset.groupby('rank')[['phd','service','salary']].mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [37]:
df_dataset.groupby('rank')['phd'].mean()

rank
AssocProf    15.076923
AsstProf      5.052632
Prof         27.065217
Name: phd, dtype: float64

In [38]:
df_dataset.isnull()

     rank  discipline    phd  service    sex  salary
0   False       False  False    False  False   False
1   False       False  False    False  False   False
2   False       False  False    False  False   False
3   False       False  False    False  False   False
4   False       False  False    False  False   False
..    ...         ...    ...      ...    ...     ...
73  False       False  False    False  False   False
74  False       False  False    False  False   False
75  False       False  False    False  False   False
76  False       False  False    False  False   False
77  False       False  False    False  False   False

[78 rows x 6 columns]

In [39]:
df_dataset['rank'].isnull()

0     False
1     False
2     False
3     False
4     False
      ...
73    False
74    False
75    False
76    False
77    False
Name: rank, Length: 78, dtype: bool

In [44]:
df_dataset[df_dataset.isnull().any(axis=1)]

Empty DataFrame
Columns: [rank, discipline, phd, service, sex, salary]
Index: []

In [45]:
df_dataset[df_dataset.isnull()]

   rank discipline  phd  service  sex  salary
0   NaN        NaN  NaN      NaN  NaN     NaN
1   NaN        NaN  NaN      NaN  NaN     NaN
2   NaN        NaN  NaN      NaN  NaN     NaN
3   NaN        NaN  NaN      NaN  NaN     NaN
4   NaN        NaN  NaN      NaN  NaN     NaN
..  ...        ...  ...      ...  ...     ...
73  NaN        NaN  NaN      NaN  NaN     NaN
74  NaN        NaN  NaN      NaN  NaN     NaN
75  NaN        NaN  NaN      NaN  NaN     NaN
76  NaN        NaN  NaN      NaN  NaN     NaN
77  NaN        NaN  NaN      NaN  NaN     NaN

[78 rows x 6 columns]

In [48]:
import pandas as pd
import numpy as np

data = {'A': [1, 2, np.nan], 'B': [4, np.nan, 6]}
df = pd.DataFrame(data)
df[df.isnull()]

    A   B
0 NaN NaN
1 NaN NaN
2 NaN NaN